In [1]:
import pandas as pd

Read a csv file with names and ID and sort in ascending order of ID. Dropping duplicates as part of Transformation.

In [7]:
df_masters = pd.read_csv(r'C:\Users\Nikkitha\Desktop\ETL\masters.csv')
df_masters.sort_values('ID',ascending=True, inplace=True)
df_masters.drop_duplicates(subset='ID', keep='first',inplace=True)
df_masters.head()

       ID      Lname      Fname                 Name
0  100001      Bogey    Hyberts       Bogey, Hyberts
1  100002  Mireielle   Lindauer  Mireielle, Lindauer
2  100003   Claiborn   Schacter   Claiborn, Schacter
3  100004  Hildagard   Eberhart  Hildagard, Eberhart
4  100005      Welsh  Westerman     Welsh, Westerman

Read a csv with ID and countries(to join it with another dataset)

In [9]:
df_lookup = pd.read_csv(r'C:\Users\Nikkitha\Desktop\ETL\lookup.csv')
df_lookup.head()

       ID Country
0  100001     USA
1  100002     USA
2  100003      UK
3  100008      UK
4  100009   China

df_masters and df_lookup is now merged by IDs

In [10]:
df_left_join = pd.merge(df_masters, df_lookup, how="left", on=['ID'])
df_left_join.drop(['Name'],axis=1, inplace=True)  #dropping the 'Name' column and retaining Lname and Fname
df_left_join.to_csv(r'C:\Users\Nikkitha\Desktop\ETL\output.csv')

In [11]:
df_left_join

       ID      Lname      Fname Country
0  100001      Bogey    Hyberts     USA
1  100002  Mireielle   Lindauer     USA
2  100003   Claiborn   Schacter      UK
3  100004  Hildagard   Eberhart     NaN
4  100005      Welsh  Westerman     NaN
5  100006    Wrennie      Platt     NaN
6  100007     Barris   Reynales     NaN
7  100008     Wendye  Cicinelli      UK
8  100009       Ethe     Slasor   China
9  100010  Valentine    Horsley     USA